/**
 ******************************************************************************
 * @file           : app.h
 * @brief          : 애플리케이션 헤더 파일
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __APP_H
#define __APP_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/

/* Exported macro ------------------------------------------------------------*/

/* Exported functions prototypes ---------------------------------------------*/
void APP_Init(void);
void APP_Run(void);

#ifdef __cplusplus
}
#endif

#endif /* __APP_H */
