/**
 ******************************************************************************
 * @file           : app.c
 * @brief          : 애플리케이션 소스 파일
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "app.h"

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  애플리케이션 초기화 함수
  * @param  None
  * @retval None
  */
void APP_Init(void)
{
  /* 애플리케이션 초기화 코드 작성 */
}

/**
  * @brief  애플리케이션 실행 함수
  * @param  None
  * @retval None
  */
void APP_Run(void)
{
  /* 애플리케이션 실행 코드 작성 */
  HAL_GPIO_WritePin(RS485_EN_GPIO_Port, RS485_EN_Pin, GPIO_PIN_RESET); // RS485_EN 핀 토글
}

/* End of file ---------------------------------------------------------------*/
